PayPalAPISoapBinding.EnterBoarding.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:EnterBoardingReq>
    <ns1:EnterBoardingRequest>
     <ns3:EnterBoardingRequestDetails>
      <ns3:ProgramCode></ns3:ProgramCode>
      <ns3:ProductList></ns3:ProductList>
      <ns3:PartnerCustom></ns3:PartnerCustom>
      <ns3:ImageUrl></ns3:ImageUrl>
      <ns3:MarketingCategory>Marketing-Category-Default</ns3:MarketingCategory>
      <ns3:BusinessInfo>
       <ns3:Type>Unknown</ns3:Type>
       <ns3:Name></ns3:Name>
       <ns3:Address>
       </ns3:Address>
       <ns3:WorkPhone></ns3:WorkPhone>
       <ns3:Category>Category-Unspecified</ns3:Category>
       <ns3:SubCategory>SubCategory-Unspecified</ns3:SubCategory>
       <ns3:AveragePrice>AverageTransactionPrice-Not-Applicable</ns3:AveragePrice>
       <ns3:AverageMonthlyVolume>AverageMonthlyVolume-Not-Applicable</ns3:AverageMonthlyVolume>
       <ns3:SalesVenue>Venue-Unspecified</ns3:SalesVenue>
       <ns3:Website></ns3:Website>
       <ns3:RevenueFromOnlineSales>PercentageRevenueFromOnlineSales-Not-Applicable</ns3:RevenueFromOnlineSales>
       <ns3:BusinessEstablished>2017-10-31T23:05:27Z</ns3:BusinessEstablished>
       <ns3:CustomerServiceEmail></ns3:CustomerServiceEmail>
       <ns3:CustomerServicePhone></ns3:CustomerServicePhone>
      </ns3:BusinessInfo>
      <ns3:OwnerInfo>
       <ns3:Owner>
       </ns3:Owner>
       <ns3:HomePhone></ns3:HomePhone>
       <ns3:MobilePhone></ns3:MobilePhone>
       <ns3:SSN></ns3:SSN>
      </ns3:OwnerInfo>
      <ns3:BankAccount>
       <ns3:Name></ns3:Name>
       <ns3:Type>Checking</ns3:Type>
       <ns3:RoutingNumber></ns3:RoutingNumber>
       <ns3:AccountNumber></ns3:AccountNumber>
      </ns3:BankAccount>
     </ns3:EnterBoardingRequestDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:EnterBoardingRequest>
   </ns1:EnterBoardingReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
